node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 7390530
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\367<c\276K\023\366;w\034\016\276\n\332\244<[\300\220\275\243`\301:,\334\330\274\003T\232<\337F <\202\264\324\275\177\016\001\276\370K\032>\"z\265\275\362\rG\276Zj\201<Y\241\266<$\372\224<\210\032d\275\231\210\025\274\323\030H\276o\306\274=\221\2404\276\005;\261=+^\271=TEH>W)t=\307M9>\303\252\001=\270}\327\275+\030\360\2759\321\222\275\274\210\340=\223\350\213=\245p.=.\252}\274\215\373D\276\030\357\002>\313\005{<\320 7\276;$g\276\262\022\027<\255\264\020<\223\366Q\2750\027<>R\216\305=\263P6\276\360\355\220\275\335\261<=\177;\342\2751\371\326>\360\367\223=y\225\200\276\304E3=\277\023\010=X\205&=\301\245\206\276w\317\337<\270\337\001\273\333.\362=\3157P>H%3\275\341Z\202\276\202\324\223\276\272Dg<@p\005=`\250{>T\253\301=!\250\325;\251\026p\275\224\377&\276\014\200\'>m)\037<C{\346<Vkj<m|B=+p\353=\351\323\000\275\233\007\345\275+\360t\275\245\3274\275\300\260\334=1t?\275\306\272q>M\2021>f\340\233;\314\024\245<q\277\240\275\022\315\372<\256\001\234\275\341e\254=\350\016\242=\305mC>\227\276\333\275hi\300<\312\372\352\273\304\3522;\201\214\321\274\327\"\373\274\371;\336=\024`\034=1dx\276) \037=S\370\233=c\030\267=\2162\266=|\361^>\244\351\002>\0330~=<1;\275bu\031<\302\033\020\275U\371g<+\312k<\361\236\267=Kw\356>\017\372[>\321\367\205=t\340\022\276\223\236\020>&\371*\276\200uR\274\205\003\244\275\33694\275N\352\301<\325\217k\275\035\030\027\276\000\270\231=Z\252\223>S\227\261\275\245\0255>\\<\271\273\022\246~>\234iT>,\250#\276\244\300p\276&y\343\275\237\260\265=zR_=\244d\021>\233}\300\274\254\234B\276\305Q\273=\323en\276\376\001:>\326\316\024\275\245(\274\275N\304\371=\n\334\244\275\266\350\346=\263H`=\014\330\365=\344Q&\276\204\377\003\274\377~\256<\007\360\025>\277\206G\2766\330\352=K\345\013>\323\363!>\026\240\345\2748\333\231\275\320\256\352=%\037E\276\375\"\254=\331\3411;\323v\274\275k\302\t\276M\365?=\203\020.>\000\002.=\202\013\023>m+a=\207\016\006\276\375.\026>M\262K>\305\026V>\216t\343;\217c\024\274\363\037Q=\255\320\010\275\022\024\252=\367e\n>\030\351`>,w\036>\261\341*\276\316\037p\276\376\303\005\2766c\337\275{9\210\276\362;\311\274\252\356\251\275z\270\342\275g*\211\273~\r\316\275\r\030B>\265a\362=2\014q>\231^\312=\351l:<%Pg\276\020+\221\276M\323\246=g\237\035>\357(U>=\370\317=Oh\222<\320R\002\274\243\020\207\274b\0334=\360\2075=yoT>\210\'\376=\\?\034=\024\360\010\276\014\021}\276\t6B=rL\354=\327\265y8\0169\314<\3558\362\275\206\252\216=\254\250\027;\311\340\031=\316eL=\357\237\001\274\213\222\022>\253\036\364\275\221^\314;\026hq=\271\251\217\274\225{\361\274\232W\240=0\352\244=\275e\324\275Cy]=\032\272\241\275\342\003 =5r\372\275f>\r>j2\207\276G\277o>O\021\033>aMM;VY\024>\314r\221=NxJ\275[~^>\213K\"\276\235D\014\276\332r4\274c\221\022>[r:>\317i\016\276\347\271\222=\036\nE=t\002\355\275\030\014\204\276\273X\244;\206\335\356\274\321\273#\275\021T\333\275\217\030\233<\326\005\326\274\222k\353\272\247\006{\275]W\224\275Sk\206>\362;J\274\360\243\327=I,\302<\267\226\206=\337U\354;\022\022u\275\201\214=>\204P\244<\305z\036\276\206\377\366\2759g)\276\371\003Y\276t\005\242\275=r\007>\206d\202\276\250\234\033>Y\346\177=k5\220\275\221u\321=X|\021=u\324\215\275\206\202\370=\270g\002>\217s\247\274[\034\006=\317\337o>\377\217\000>-1a\275\345^\225>=>\251=\312\254\026:\331\353E>E\330\334=\024\365\006>B4\261:\370\236\375\275\266\330}\274C\277\001>\016\263?\276\332d=\275\206\321\347=a\330\000=\031\230\024\2762lD\276\020\010\242\275 \242X>rO\331\274\264\304\001<(\275\031>\241\315\014>4Y\335\274\002P\344=$\233}\274\323\240\342<\235lL\275\330\0366>\362\356Y\276.\327\003\276wP\310\275\230\021\245<\241d?>\017L!\275`<\014\276RP\205\276\272vh<\254OQ>\004\356\351=\221\326\312\275\014\236\316\276$\201J=\216lZ:\014M?<\200*d=\301\026\">k\237\352\275\"C\023\275Up\262<\327\360\310\275)J,=\337\303\027>\257X\251\273\004\315\004<\343\221\211\275\003`\376\275\230N\232>\354\226/\2744b<>\255l\273=\0363\035\275\342H.\276\222@\017=\316\235\316=A-\202\275%\275\031>\372\"\260\275\017\t\347<t*\215>\010\302N\276\035D\240=>\313&\274D\206\247\2757\372\027\2769\036\247\275k\305\252\274/\313[\275\024\300z\275\010\352q;\036\335\345=\3711\000>\312Y\357\275\354?\376\275\357 \235=dt\023=+C\010\274\262#\253=\313\266\307=\302E\363;0t\320\275\266\016Q=\364\373\233\274Z4g\276\314\277c>K7\033>\342\240\210\276q\216I\275\251\331{\275\376nI\276z\361\023>iT\305\275\242\3376>ag\357=\377a1\275z\256g>\271\252\314=\2209\000\276\327\245X\276\212\224\235;\230M\266>yV\335\275\226\262\343=\217F\177>J}\013\275S!\325=& \275\275\265\312\210\274\001v\344\275\343 \346;\030\371\266\275\272pX=\317E\205=\352s\262=\227\345(\275\263\245\\\273\223_\036\276|\234p\273\300l1<\245\245\270\275\033I\017>\374rQ\275\357\014U>c\305\026\272\037J\320\275a\031\264\275\345\365\337\275\315\345\022=\034!\337\275\227\037M\276.\313\266\2758\202\215>\202\321S\276\316\231\267=\323x\253=\362\371A>\374i\035\275\021QH>\037\031N\274\275\351\213<\nH\364\275\001\313\016\276\221\243\205\276\240\377\036\276zL\245\275\"\312\013>\310\217$=u\352\2418\374%\254\274g\321\346=\324\272t\276-\033W>JA!<jOc\275rRR\276\021H\007\275]%k>v\365\003\274?Hi\274\336f\250=\314N\254<\003\327\225\275\2772R=\250+M\274\205\304:>p/B\275\347\330\217=\226\234\035=a!)\276C\023X> L >\344\320a\276\207\326\034>\332\332\317\274\265\276?;\201\034\266=NO\035\275G\270\204>8\224\243<\3321&\2768\3064\276\265\010P>\254?\323\275\323s\322=\030t\013>\216\365\220\275M\363\016>;\205\000\276\003\250\013\274\254\252\264\275\013\033C>Q\210\365\274\\\300\215=f\2000>\355\373\210\275x\325;\276\034\342w<\272\223\214>1\2713=\366\265\323\275\026\240\001>[Z\344\275\241G\005=\022g\246\275\277\323\351=\357\242K\276\203\2629=`\351:\276Z\344p\275X\363\222=\"\t\221\274?p\030\276\024`\006\276j\342\\>+\351\033\276w\263\030<\234\2757\276H\240\227\275\021\332.>\250\223\307\275\253\316\350=d\274h\276\305\234\001>U\220H<^\272\365=\027I\325\275y\271\320\275\324_\202:\002v\001\276\372((>\375|\237=\240\237`<\250C!>\240\025B\276\317\327\n=\212\242\213<w\357(\275S\307\316<\300\232\267\274\211[\275\274\336&3\276\261aM\276*\221\016>,\033M\275g\013\036=\220\320\372\273Q\230m\275\216\267\004>-WP\275\361\036\214>\325\006-=\305\363\310\274 \263\215\274\307\243\345\275\013\377P>\2668#>y\331\210\276R\265#\275\226b\254=\300\335\023=\002\356}=(\254\250>\327\243\034\276\363\340\016\275\343\026\231\275\377\336\257\276n@Q\276\313\035`\276_%J=\3350\236=\273b0\2758@\026=\224\370\300\275O\r\236\275S4\276\274aV\233=\237\032H\276\263\324\272\275\245\310\253<\231\200\212\275hh\353=\005\r^=\357\036\002<\322m\326<{\010\222>\315\317\037\275\265\265\344=\366j\030\276V\\e<X\257\350\275\354L:>)\204\227\275h$\267\275\341\373M\275\311l\311=\021=i<\240\267C\276&&_<\235\311;\276\275\013\261\275\351\2379>\210\344\274<#u4\275-Ks\276\305\245%\276u\363\336<\317I\217;\261\256\336<W$\301\275r&\362<\256Z\024=\340l\324=8E\353=\326^\263<\013p\306\274S>b\276@\304L\276`\317\214=\367\237\252;\346\252\024\276$Q\265\275w\330\036>i\006h\275\234Uu\276z\226\260\273\260m\335\273-0\026=\"<\212\2751\250\341>l\302\360=O;V>\035\215\233<\263nO>3\373\037\275\320\016\316\2747k\335<\016\314x\274N\302<>\307Y\200=\331\312\231\274x\206\024\276\021e\264=o\366\002\275\237\357\317=\357\007\2149\304R\277;>rs\276\204)|\275\343D\234\275\270\331\323<\'\325\017\275\260~c>\324\274\221<\254\226\261\275\031\217!\276\2649->\n\"\267\274\006c5>\r\365\264\275\203aU\275\2561m=\274\336\204\276\311\\\221=B{\021>V\263\204>\230~W\276\342\254\341\275\265\364\236=au\302\275D\230\031\276\362\301\n>\006\210\277\275\231\242\236\275\234\031\214\275\037\030!>\317\343o\275$\276\002>0u\364=dRE\275\375\366E>\200\247(\276\216\320\273\274N\005\024=M\306\227\274^U\301=.X=>\223\te=DI\252\275%\"t>\355\224\217\276\321\'\207\275\023\2457:\371\233\016\276\247\307\010\275\257\253.>\303Nn\275L\221\301\274=\215\352\275f&J<\341\"n\275xV\000=i\3050>d\244\213>D4~\273u[\344\275\332*N=\234!i=\327\202\277\275\305\324@\274\335\3475\276\324-\'\274 q\233=\313\\\253\274@\216\205\276\362\250\006\276\351\013\003>LI\030<c\271\004>\025\207\026=\036\303\222\276\335\207\362\275\220<\373\275\002f\217=\221^\203\275\335e\207\276\006aR\276\313E\272=\021\007\207\276\265\345}\275\356\033M\275\240\342\361\274:\314\003=\333Q0=FR9\274\244\231\177=\250\016\034>\333\262\322=6\323l\276\020@\227=\334\317o=\361SW=]\357N\276\000\337\276=\"\235\375\275u>\010\276\226\231\342=\223\243+>zA\003\276\351\347\214\275)5\230\275\224^Q\275}(\036\276\313\276\272=\201\3649\275\252\037\255=k/C>\333Q\270\275V\271G>\203\303\034>\n\303I\276s\363\262=\t\351(=\332\316\\\273\340\354\214<\331\031\004>\274[\302=\314\237\240=\r\257\310\275\311\370\223<\'\314\351=\256\245\200\275T\214\241=\207L\223\276>1,>\251\221\016=\342\362:>\225%\356;\345=g>\304\021\000=\025\230\220=\214Nv=\323J\206\275\333LF>\177\364f\275L\314\251\275\320\344\262\275\261\201[\276\302\276[>f\305\010\275\345T=>\306\257o<g\033\202=\325\004\226=\306\225;\275\300.Z\275!\262\037\276*)u>3\210\242=)\r\245\274\372\034a\276\352\364\035=\201T]\276\334o}\276VA\024>\204\333.>\347u.\276\345K3>\201.0>\241o\276\275P\355\376\275\347e\003>FR\"=\274A\215>u\021\003>\277\232\020\276\272\213\002>\232}\032\276\370,\000\275-O\326\275\252\272\252\274\307\227\002\276B\205\"=k\255u=\257e\242\2751>\353<l \255\274Q\003^>\376\027\024\276\016\345\335\275\353\233\256\275\213rg=VY\331=\316\347_\275\207W\275=I\227\202=$1\272\274\243N\314\274Mi.\276\014\355\250\272[\177\r=\251\003&<K\326\347\2754Qs\275r\227\001<Op\321=\016\036\261\275\0050F\275\037Z\213=\217\2267>\010\314#=\260\243\317=\216#\250\276\213\347\262<\367\235\255=yH\030\274F\363\275<Ix\276=\341\345\346\273_\265U>\243e\240=N\016\230\276v \267\274\333f\340\275\226d \276\004E;>\312\247)=dab>GP\366<\375\263)=$\324|>~[]\276\203Z\362<7.\200<\300Y[=\223\343\204\2764\264\214\275v\336\347\275\022[\356\274\210\373\000=N\230 <~\246Z=\227>\035\276\320\373 \275\301O\253=\256\233^=\314\247\217=m&\036\2766\243\t\276\330\213\357=\211\030\322\274w\003)=\330\354\274<\022\340]\276\364:\200>\364\354\200\276\023\347\037\276\342M\033\276\322\234\263\273gWR=D>3\275\317P\365\275#\245\n=\234?\037=P8D=\235\325\030\276H|\227=\315\356\225\275\327\360\014>O3\220=\017\220Y>\241\237\030\275a\312\273\275\022/\034>\265_\317\275\006\033\010>\311\246\247\272\',\274=j\360M\276O\371\321=\223\201\200\276;\265H\276\021\273\322=Y\3349>\214!k=*\244\301<\007\372\254\2746\030}>\336\003!\276\325\036/\276r\005\212\275.cV\275:\337\301=\202\240\305;\277y\030\275\344\262\\<\274a\343\275p\365l>\371\257\r\275\350\037\224<|\250\225\275\'\237\340<\026v\335=\201\312\335=\306\242\216>\267/\006\276\213b\244\275z3E<\231\242\367\275\266|S\275[\263\254>\245\225\230\275\227\022\274\275d\331\332=\'\340\224\2762\341\014\275\266\255\266\275R\336@=\365\027\333=\021\010\232<\263G\237=r\343\354=`M\001\275l\270\343\275\020\311\357\274M-\032<Za\006\276\257Xf>9x\027=\252\017\261<s\373\213=\314\341\241\276\227\212&=\304\277\017>\003\214t>\345&\224=1\3732>\2401d\274\376\016y=F<e=bC\314=\"\006\350=\333ti=\323I\377;\344j\321=D\321\024\275u\2341>=\236x\276\014y\031\276\372&,=\377\365\316=\232i\002\276w\240?>C\223k>\316\276\215>\322,R\276\214+\340<#\221\217\275\253S\002\276\312\002H\275j\3010\276TW\240\275\036\2628=\357\022\366<\035\027d\275\030O~\276G\200\024><\017\220=\334m\010\276\227\017\317=\266P\350=|\333\203\274\354w\373=J\365\273\2753\213[\276i\024\030=\004I\247\275\320\270\r>`\253[>j\240\000\276\225L\335;!\323\217=Q}\026=b\261g=\214oU\275\010\256\335=\r\305\260=\346,\210=\374\265%\276\3349\003>\351\2436>\202\017I=\233E\035\276P\n\370=Z\344\362\273l\230K\276\032\336\341=\273b\227\275k b>\225\210\261\275\357\344\223\275\233\005@\276\263\031\254\275\356$f>\0227\036\275\357)\377\275\343\224)=\242\325\375\273\027\312\276\274\3568\333<\023\374o=R\224\252\275o\007B\275\320\347\004>\356\346\256\275ZB\235\275\234|\310=\020\244\362\274\351\241\326<\252\217T=\335\233h=\375\324\337=Z,\227>\026*\023\276^|9>a@\303\275\026lk>\3063P>.u\032=\023\355|\276o\353\016\276\202\321T>)\360\205\276A\320\010>\023\337\250=P\025N\275\007\223\224<\237[\311\275\201\200\212\275\363Q\245>]\262\210\2765/\027\275\300\214\305=.\210\017\275\230\014\355=\317\376\374=_\347\336\275\362\2119>\3008\023\275\371\261b\276h\371\347=\0172e\276\257\240\241\272\016z.\276\322\327{=\023z\253=\362x\037\276A\256n=\217\236\2579^\004)>\334\357V=\350\004\024\276\005\232L>g\0176>\306\351\004>D \260=\372\231\205=\207\216o\274\236\241Q>\311\261@=\233\364u\274\t\366\335\274;\227C\276\214\225b>\225\003w\272\2001n<E@\020;\367B\252=\\e&\276U\001\264\275z\243\210\275\2724\320\275\207\357\377=\004\221\032\276b\353,\275\241g\205>\023\245{\275k\023r\275\273/\202\275\274:r\276\332\340\361\275\000u\213=\351\300#\274\375)\230=\375\017e=Tw\\\275z0\002\275\256}v=h2\247\275|\026D\275\365\305r;-\245\031=\202\275}=O\r.\276e\202\203=\033\007t\275& 5\275B+\256=\376\240\t>\031_\226=,s\241=-XT=\223\0014\275my\205\276\331\272\202=n\371\265\275~)\215\275\002\2539\275:\344\245<C=l>\024\313\032\275\373\355\302\275\250.z\276y\036\305=\376\236N\276\321\344u\276N\000)\276\204\272\340=DG\341\275k\256\332=\021\330\001\276\327\260\236\274d\'\004> \366\'=[\326o>?*T>\362E4>\270\013\024>S\"\024\276\375s!\276\"j\245\275/\352h\276\227\273\346\275D\010\255\275\003|\001>\257\033Y;1\021\252\275\004s\215=\204\3164\275 _\204>\357g \276\n\220\n>*%\017\276j\017<<Ig\010\275\204\022\033>\021\2700>"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
